In [1]:
import sqlalchemy
import pandas as pd
from sqlalchemy import create_engine
db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_classifier_abd"
db = create_engine(db_string)

In [2]:
select_string='SELECT * FROM genres' 
df=pd.read_sql(select_string,con=db)
df

     genre_id                  name
0           0                 Drama
1           1          World cinema
2           2      Action/Adventure
3           3       Science Fiction
4           4                Action
..        ...                   ...
358       358        Statutory rape
359       359  Silhouette animation
360       360     Children's Issues
361       361         Homoeroticism
362       362            Neorealism

[363 rows x 2 columns]

In [3]:
select_string='SELECT * FROM genres_movies' 
df=pd.read_sql(select_string,con=db)
df

          id  movie_id  genre_id
0          0  23890098         0
1          1  31186339         2
2          2  20663735         5
3          3   2231378         7
4          4    595909         9
...      ...       ...       ...
41788  41788  34808485        74
41789  41789   1096473        60
41790  41790  35102018        21
41791  41791   8628195         0
41792  41792   6040782         8

[41793 rows x 3 columns]

In [6]:
select_string='SELECT setseed(0.5); SELECT * FROM movies WHERE random()>0.9' 
df=pd.read_sql(select_string,con=db)
df

,movie_id,plot,movie_name
0,26836627,"The film centers around Stacy and Goody , two ...",Vamps
1,23487733,"Abhiram or Abhi, as called by his friends and...",Kadhalna Summa Illai
2,13882169,During secret subterranean scientific experime...,Shadowzone
3,3793631,"In 2027, after 18 years of worldwide female in...",Children of Men
4,32704611,Writer Muraki becomes obsessed with a porn sta...,Angel Guts: Red Classroom
...,...,...,...
4290,163451,"The young Lillian and the young Julia, daughte...",Julia
4291,26719946,The comedy film revolves around a blind Love l...,Srivariki Premalekha
4292,19389196,"Confined to a neck brace, poor little rich boy...",Free Wheeling
4293,34627142,San Francisco. Two teenagers playing hide and ...,Light Blast
4294,23892202,Who the Hell is Juliette? begins with Yuliet O...,Who the Hell Is Juliette?

In [ ]:
# ZADANIE

In [10]:
# import danych z bazy

select_string = ('SELECT setseed(0.5); '
                'SELECT movies.movie_name title, movies.plot, genres.name genre FROM movies '
                'LEFT JOIN genres_movies ON movies.movie_id = genres_movies.movie_id '
                'LEFT JOIN genres ON genres_movies.genre_id = genres.genre_id '
                'WHERE random()>0.9')
            
df=pd.read_sql(select_string,con=db)
df

,title,plot,genre
0,Flåklypa Grand Prix,"In the town of Flåklypa , the inventor Reodo...",Stop motion
1,Star Trek II: The Wrath of Khan,The film opens with Lieutenant Saavik in comm...,Thriller
2,The Big Lebowski,"Jeff ""The Dude"" Lebowski returns home only to ...",Crime Fiction
3,Taxi Driver,"Travis Bickle , an honorably discharged U.S. M...",Thriller
4,Night of the Living Dead,The story begins with the siblings Barbra and...,Horror
...,...,...,...
4290,Love and Curses,"An old hero, Harold, is looking through a phot...",Short Film
4291,"Shake, Rattle and Roll: An American Love Story","In the 1950s, Lyne Danner, whose father was in...",Drama
4292,The Life of Chikuzan,The real Chikuzan appears on a stage in a smal...,None
4293,Shariyo Thetto,{{expand-section}} The story revolves around A...,Drama
4294,Thoppul Kodi,Thoppul kodihttp://qualitymp3.blogspot.in/2011...,Drama

In [19]:
# ilość filmów z danej kategorii
genres = df.groupby(by='genre').agg('count')
genres = genres.sort_values('title', ascending=False)
genres.head(10)

                  title  plot
genre
Drama               550   550
Thriller            527   527
Crime Fiction       320   320
Short Film          308   308
Romantic comedy     198   198
Romance Film        187   187
Horror              122   122
Comedy              116   116
Action/Adventure    112   112
Science Fiction      95    95

Wybrany gatunek to: Drama

In [22]:
# kolumna z 0 gdy film jest tego gatunku
df['Drama'] = df['genre'] != 'Drama'
df

,title,plot,genre,Drama
0,Flåklypa Grand Prix,"In the town of Flåklypa , the inventor Reodo...",Stop motion,True
1,Star Trek II: The Wrath of Khan,The film opens with Lieutenant Saavik in comm...,Thriller,True
2,The Big Lebowski,"Jeff ""The Dude"" Lebowski returns home only to ...",Crime Fiction,True
3,Taxi Driver,"Travis Bickle , an honorably discharged U.S. M...",Thriller,True
4,Night of the Living Dead,The story begins with the siblings Barbra and...,Horror,True
...,...,...,...,...
4290,Love and Curses,"An old hero, Harold, is looking through a phot...",Short Film,True
4291,"Shake, Rattle and Roll: An American Love Story","In the 1950s, Lyne Danner, whose father was in...",Drama,False
4292,The Life of Chikuzan,The real Chikuzan appears on a stage in a smal...,None,True
4293,Shariyo Thetto,{{expand-section}} The story revolves around A...,Drama,False
4294,Thoppul Kodi,Thoppul kodihttp://qualitymp3.blogspot.in/2011...,Drama,False

In [24]:
# stworzenie model bag of words

from sklearn.feature_extraction.text import CountVectorizer

vectorizer = CountVectorizer(strip_accents='ascii', stop_words='english', lowercase=True, max_features=20)

In [27]:
#TESTY
cat_in_the_hat_docs=[
       "One Cent, Two Cents, Old Cent, New Cent: All About Money (Cat in the Hat's Learning Library",
       "Inside Your Outside: All About the Human Body (Cat in the Hat's Learning Library)",
       "Oh, The Things You Can Do That Are Good for You: All About Staying Healthy (Cat in the Hat's Learning Library)",
       "On Beyond Bugs: All About Insects (Cat in the Hat's Learning Library)",
       "There's No Place Like Space: All About Our Solar System (Cat in the Hat's Learning Library)" 
      ]

cv = CountVectorizer(cat_in_the_hat_docs, max_features=20)
count_vector=cv.fit_transform(cat_in_the_hat_docs)

cv.vocabulary_

{'one': 10,
 'cent': 3,
 'old': 8,
 'all': 1,
 'about': 0,
 'cat': 2,
 'in': 5,
 'the': 18,
 'hat': 4,
 'learning': 6,
 'library': 7,
 'outside': 12,
 'you': 19,
 'that': 17,
 'staying': 15,
 'on': 9,
 'space': 14,
 'our': 11,
 'solar': 13,
 'system': 16}